In [61]:
# !pip install pandas

In [1]:
import pandas as pd

In [2]:
# 1. Do not disturb the Original Data 
# 2. DO not edit anything on the data manually

In [3]:
df = pd.read_csv('../00_Data/data.csv')
df.head()

,Salary Date,Salary Month,Salary ID,Salary Status,Employee ID,Employee Name,Gender,Generation,Joining,Termination,...,Term Sub Reason,Employee Grade,Location,Career Bucket,Age Bucket,Manager ID,Manager Name,Performance,Talent,Department
0,2011-05-15,2011-05,100001_2011-05,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,...,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA
1,2011-05-15,2011-05,100002_2011-05,Active,100002,Name_100002,Male,Gen X,2001-09,NaN,...,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,D,A,AA
2,2011-05-15,2011-05,100003_2011-05,Active,100003,Name_100003,Female,Gen X,2008-08,NaN,...,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,C,B,AA
3,2011-05-15,2011-05,100004_2011-05,Active,100004,Name_100004,Female,Millennials,2008-07,NaN,...,NaN,Junior,Bengaluru,Below 30,26 To 30,100001,Name_100001,E,NaN,AA
4,2011-06-12,2011-06,100001_2011-06,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,...,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA

In [4]:
pd.set_option('display.max_columns', None)

In [5]:
df.head()

,Salary Date,Salary Month,Salary ID,Salary Status,Employee ID,Employee Name,Gender,Generation,Joining,Termination,Term Category,Term Reason,Term Sub Reason,Employee Grade,Location,Career Bucket,Age Bucket,Manager ID,Manager Name,Performance,Talent,Department
0,2011-05-15,2011-05,100001_2011-05,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,NaN,NaN,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA
1,2011-05-15,2011-05,100002_2011-05,Active,100002,Name_100002,Male,Gen X,2001-09,NaN,NaN,NaN,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,D,A,AA
2,2011-05-15,2011-05,100003_2011-05,Active,100003,Name_100003,Female,Gen X,2008-08,NaN,NaN,NaN,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,C,B,AA
3,2011-05-15,2011-05,100004_2011-05,Active,100004,Name_100004,Female,Millennials,2008-07,NaN,NaN,NaN,NaN,Junior,Bengaluru,Below 30,26 To 30,100001,Name_100001,E,NaN,AA
4,2011-06-12,2011-06,100001_2011-06,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,NaN,NaN,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA

In [6]:
# List out All Columns
df.columns

Index(['Salary Date', 'Salary Month', 'Salary ID', 'Salary Status',
       'Employee ID', 'Employee Name', 'Gender', 'Generation', 'Joining',
       'Termination', 'Term Category', 'Term Reason', 'Term Sub Reason',
       'Employee Grade', 'Location', 'Career Bucket', 'Age Bucket',
       'Manager ID', 'Manager Name', 'Performance', 'Talent', 'Department'],
      dtype='object')

1. Salary Date

In [7]:
df['Salary Date'].describe()

count          78377
unique            66
top       2016-10-15
freq            1351
Name: Salary Date, dtype: object

In [8]:
# Date Range {m/d/y}
df['Salary Date'].min(), df['Salary Date'].max()

('2011-05-15', '2016-10-15')

2. Salary Month

In [9]:
df['Salary Month'].describe()

count       78377
unique         66
top       2016-10
freq         1351
Name: Salary Month, dtype: object

3. Salary ID

In [11]:
df['Salary ID'].describe()

count              78377
unique             78377
top       100001_2011-05
freq                   1
Name: Salary ID, dtype: object

Salary Status

In [12]:
df['Salary Status'].describe()

count      78377
unique         2
top       Active
freq       77791
Name: Salary Status, dtype: object

In [13]:
df['Salary Status'].unique()

array(['Active', 'Inactive'], dtype=object)

In [14]:
df['Salary Status'].value_counts()

Salary Status
Active      77791
Inactive      586
Name: count, dtype: int64

Employee ID

In [15]:
df['Employee ID'].describe()

count     78377.000000
mean     101009.592585
std         587.206395
min      100001.000000
25%      100511.000000
50%      101006.000000
75%      101493.000000
max      102285.000000
Name: Employee ID, dtype: float64

In [16]:
# Memory Usage

df.memory_usage(deep=True)

Index                  132
Salary Date        4624243
Salary Month       4389112
Salary ID          4937751
Salary Status      4311907
Employee ID         627016
Employee Name      4702620
Gender             4186799
Generation         4550598
Joining            4389112
Termination        2523886
Term Category      2523300
Term Reason        2530332
Term Sub Reason    2526214
Employee Grade     4188809
Location           4537052
Career Bucket      4467489
Age Bucket         4467315
Manager ID          627016
Manager Name       4702620
Performance        3918850
Talent             3381802
Department         3997227
dtype: int64

In [17]:
# Change the Category Type
df['Employee ID'] = df['Employee ID'].astype('category')
df.memory_usage(deep=True)

Index                  132
Salary Date        4624243
Salary Month       4389112
Salary ID          4937751
Salary Status      4311907
Employee ID         241122
Employee Name      4702620
Gender             4186799
Generation         4550598
Joining            4389112
Termination        2523886
Term Category      2523300
Term Reason        2530332
Term Sub Reason    2526214
Employee Grade     4188809
Location           4537052
Career Bucket      4467489
Age Bucket         4467315
Manager ID          627016
Manager Name       4702620
Performance        3918850
Talent             3381802
Department         3997227
dtype: int64

In [19]:
# Change to String Type
df['Employee ID'] = df['Employee ID'].astype('string')
df.memory_usage(deep=True)

Index                  132
Salary Date        4624243
Salary Month       4389112
Salary ID          4937751
Salary Status      4311907
Employee ID        4310735
Employee Name      4702620
Gender             4186799
Generation         4550598
Joining            4389112
Termination        2523886
Term Category      2523300
Term Reason        2530332
Term Sub Reason    2526214
Employee Grade     4188809
Location           4537052
Career Bucket      4467489
Age Bucket         4467315
Manager ID          627016
Manager Name       4702620
Performance        3918850
Talent             3381802
Department         3997227
dtype: int64

Best Choice - Category Type

In [21]:
# Change the Category Type
df['Employee ID'] = df['Employee ID'].astype('category')

In [22]:
df['Employee ID'].describe()

count      78377
unique      2285
top       101300
freq          66
Name: Employee ID, dtype: object

In [23]:
# We can understand from unique values, there are row which are repeating 
# multiple times for the same employees due to every month salary
# There are totally 2285 employees

Employee Name

In [24]:
df['Employee Name'].describe()

count           78377
unique           2285
top       Name_101300
freq               66
Name: Employee Name, dtype: object

Gender

In [26]:
df['Gender'].describe()

count     78377
unique        2
top        Male
freq      61968
Name: Gender, dtype: object

In [27]:
df['Gender'].value_counts(normalize=True) * 100

Gender
Male      79.064011
Female    20.935989
Name: proportion, dtype: float64

In [28]:
# Totally 79% Male Employees and  21% Female Employees are working

Generation

In [29]:
df['Generation'].describe()

count           78377
unique              4
top       Millennials
freq            52494
Name: Generation, dtype: object

In [30]:
df['Generation'].unique()

array(['Gen X', 'Millennials', 'Gen Z', 'Baby Boomers'], dtype=object)

In [31]:
df['Generation'].value_counts()

Generation
Millennials     52494
Gen X           24368
Gen Z            1047
Baby Boomers      468
Name: count, dtype: int64

Joining

In [32]:
df['Joining'].describe()

count       78377
unique        241
top       2006-10
freq         1533
Name: Joining, dtype: object

Termination

In [34]:
df['Termination'].describe()

count            586
unique           410
top       2012-07-16
freq               9
Name: Termination, dtype: object

In [35]:
# Employee terminated date given, 9 employees max resigned in a same day
# Joining and Termination are important columns for our prediction

Term Category

In [36]:
df['Term Category'].describe()

count           586
unique            1
top       VOLUNTARY
freq            586
Name: Term Category, dtype: object

In [37]:
df['Term Category'].value_counts()

Term Category
VOLUNTARY    586
Name: count, dtype: int64

Term Reason

In [38]:
df['Term Reason'].describe()

count                       586
unique                        1
top       Voluntary Termination
freq                        586
Name: Term Reason, dtype: object

Term Sub Reason

In [40]:
df['Term Sub Reason'].describe()

count               586
unique               16
top       Career Growth
freq                205
Name: Term Sub Reason, dtype: object

In [41]:
df['Term Sub Reason'].unique()

array([nan, 'Career Growth', 'Personal Reason',
       'Relocated to Other Branch', 'Salary Hike', 'Higher Studies',
       'Relocation to Native', 'Internal Politics', 'Company Rules',
       'Health Issues', 'Work Life Balance', 'Marriage',
       'Not Suitable Job for the Skills', 'Miscellaneous',
       'Family Problems', 'Not Interested in JOB', 'Work Stress'],
      dtype=object)

Employee Grade

In [43]:
df['Employee Grade'].describe()

count     78377
unique        3
top         Mid
freq      40642
Name: Employee Grade, dtype: object

In [44]:
df['Employee Grade'].value_counts()

Employee Grade
Mid       40642
Junior    33667
Senior     4068
Name: count, dtype: int64

Location

In [45]:
df['Location'].describe()

count         78377
unique            7
top       Bengaluru
freq          71138
Name: Location, dtype: object

In [46]:
df['Location'].value_counts()

Location
Bengaluru     71138
Chennai        3072
Hyderabad      1995
Gujarath       1229
Vadodara        817
Pune            125
Coimbatore        1
Name: count, dtype: int64

Career Bucket

In [47]:
df['Career Bucket'].describe()

count        78377
unique           3
top       Above 35
freq         36893
Name: Career Bucket, dtype: object

In [48]:
df['Career Bucket'].value_counts()

Career Bucket
Above 35    36893
31 to 35    32253
Below 30     9231
Name: count, dtype: int64

Age Bucket

In [49]:
df['Age Bucket'].describe()

count        78377
unique          10
top       31 To 35
freq         23509
Name: Age Bucket, dtype: object

In [50]:
df['Age Bucket'].value_counts()

Age Bucket
31 To 35    23509
36 T0 40    20513
26 To 30    15074
41 T0 45     8543
21 To 25     5699
46 T0 50     3730
51 T0 55     1099
56 T0 60      174
>60            30
<=20            6
Name: count, dtype: int64

Manage ID

In [51]:
df['Manager ID'].describe()

count     78377.000000
mean     101168.051444
std         740.858770
min      100001.000000
25%      100598.000000
50%      101121.000000
75%      101590.000000
max      102737.000000
Name: Manager ID, dtype: float64

In [52]:
df['Manager ID'] = df['Manager ID'].astype('category')
df['Manager ID'].describe()

count      78377
unique       741
top       100076
freq        1032
Name: Manager ID, dtype: int64

Manager Name

In [53]:
df['Manager Name'].describe()

count           78377
unique            741
top       Name_100076
freq             1032
Name: Manager Name, dtype: object

Performance

In [54]:
df['Performance'].describe()

count     78377
unique        5
top           B
freq      32539
Name: Performance, dtype: object

In [55]:
df['Performance'].value_counts()

Performance
B    32539
E    20897
C    17885
D     6535
A      521
Name: count, dtype: int64

TALENT

In [56]:
df['Talent'].describe()

count     48541
unique        4
top           B
freq      23158
Name: Talent, dtype: object

In [57]:
df['Talent'].value_counts()

Talent
B    23158
A    14200
C    10298
D      885
Name: count, dtype: int64

Department

In [58]:
df['Department'].describe()

count     78377
unique      119
top          AI
freq      17043
Name: Department, dtype: object

In [59]:
df['Department'].value_counts()

Department
AI    17043
AY     6248
BF     5740
AD     5138
AP     4441
      ...
CI        2
EF        1
CP        1
CY        1
CK        1
Name: count, Length: 119, dtype: int64

In [60]:
df.head()

,Salary Date,Salary Month,Salary ID,Salary Status,Employee ID,Employee Name,Gender,Generation,Joining,Termination,Term Category,Term Reason,Term Sub Reason,Employee Grade,Location,Career Bucket,Age Bucket,Manager ID,Manager Name,Performance,Talent,Department
0,2011-05-15,2011-05,100001_2011-05,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,NaN,NaN,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA
1,2011-05-15,2011-05,100002_2011-05,Active,100002,Name_100002,Male,Gen X,2001-09,NaN,NaN,NaN,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,D,A,AA
2,2011-05-15,2011-05,100003_2011-05,Active,100003,Name_100003,Female,Gen X,2008-08,NaN,NaN,NaN,NaN,Mid,Bengaluru,Above 35,36 T0 40,100001,Name_100001,C,B,AA
3,2011-05-15,2011-05,100004_2011-05,Active,100004,Name_100004,Female,Millennials,2008-07,NaN,NaN,NaN,NaN,Junior,Bengaluru,Below 30,26 To 30,100001,Name_100001,E,NaN,AA
4,2011-06-12,2011-06,100001_2011-06,Active,100001,Name_100001,Male,Gen X,2001-07,NaN,NaN,NaN,NaN,Senior,Bengaluru,Above 35,41 T0 45,102286,Name_102286,E,NaN,AA